#Importing stuffs

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sbrn

In [ ]:
data = pd.read_csv("https://raw.githubusercontent.com/21accel/bank_churn_prediction/main/BankChurners.csv")
data.drop(columns=['CLIENTNUM'], axis=1, inplace=True)
data

          Attrition_Flag  ...  Avg_Utilization_Ratio
0      Existing Customer  ...                  0.061
1      Existing Customer  ...                  0.105
2      Existing Customer  ...                  0.000
3      Existing Customer  ...                  0.760
4      Existing Customer  ...                  0.000
...                  ...  ...                    ...
10122  Existing Customer  ...                  0.462
10123  Attrited Customer  ...                  0.511
10124  Attrited Customer  ...                  0.000
10125  Attrited Customer  ...                  0.000
10126  Attrited Customer  ...                  0.189

[10127 rows x 20 columns]

#Encoding Data

##Attrition Flag

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Attrition_Flag"] == "Attrited Customer":
    data.at[i,'Attrition_Flag'] = 1
  elif data.at[i,"Attrition_Flag"] == "Existing Customer":
    data.at[i,'Attrition_Flag'] = 0
data['Attrition_Flag']

0        0
1        0
2        0
3        0
4        0
        ..
10122    0
10123    1
10124    1
10125    1
10126    1
Name: Attrition_Flag, Length: 10127, dtype: object

In [ ]:
data

      Attrition_Flag  Customer_Age  ... Total_Ct_Chng_Q4_Q1  Avg_Utilization_Ratio
0                  0            45  ...               1.625                  0.061
1                  0            49  ...               3.714                  0.105
2                  0            51  ...               2.333                  0.000
3                  0            40  ...               2.333                  0.760
4                  0            40  ...               2.500                  0.000
...              ...           ...  ...                 ...                    ...
10122              0            50  ...               0.857                  0.462
10123              1            41  ...               0.683                  0.511
10124              1            44  ...               0.818                  0.000
10125              1            30  ...               0.722                  0.000
10126              1            43  ...               0.649                  0.189

[10127 rows x 20 columns]

##Customer Age

In [ ]:
# for i, row in data.iterrows():
#   if data.at[i,"Customer_Age"] >= 20 and data.at[i,"Customer_Age"] < 30:
#     data.at[i,'Customer_Age'] = 1
#   elif data.at[i,"Customer_Age"] >= 30 and data.at[i,"Customer_Age"] < 40:
#     data.at[i,'Customer_Age'] = 2
#   elif data.at[i,"Customer_Age"] >= 40 and data.at[i,"Customer_Age"] < 50:
#     data.at[i,'Customer_Age'] = 3
#   elif data.at[i,"Customer_Age"] >= 50 and data.at[i,"Customer_Age"] < 60:
#     data.at[i,'Customer_Age'] = 4
#   elif data.at[i,"Customer_Age"] >= 60 and data.at[i,"Customer_Age"] < 70:
#     data.at[i,'Customer_Age'] = 5
#   elif data.at[i,"Customer_Age"] >= 70 :
#     data.at[i,'Customer_Age'] = 6
# data['Customer_Age']

##Gender

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Gender"] == "M":
    data.at[i,'Gender'] = 1
  elif data.at[i,"Gender"] == "F":
    data.at[i,'Gender'] = 2
data['Gender']

0        1
1        2
2        1
3        2
4        1
        ..
10122    1
10123    1
10124    2
10125    1
10126    2
Name: Gender, Length: 10127, dtype: object

##Education_Level

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Education_Level"] == 'Uneducated':
    data.at[i,'Education_Level'] = 0
  elif data.at[i,"Education_Level"] == 'High School':
    data.at[i,'Education_Level'] = 1
  elif data.at[i,"Education_Level"] == 'College':
    data.at[i,'Education_Level'] = 2
  elif data.at[i,"Education_Level"] == 'Graduate':
    data.at[i,'Education_Level'] = 3
  elif data.at[i,"Education_Level"] == 'Post-Graduate':
    data.at[i,'Education_Level'] = 4
  elif data.at[i,"Education_Level"] == 'Doctorate':
    data.at[i,'Education_Level'] = 5
  elif data.at[i,"Education_Level"] == 'Unknown':
    data.at[i,'Education_Level'] = -1
data['Education_Level']

0         1
1         3
2         3
3         1
4         0
         ..
10122     3
10123    -1
10124     1
10125     3
10126     3
Name: Education_Level, Length: 10127, dtype: object

##Marital_Status

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Marital_Status"] == 'Single':
    data.at[i,'Marital_Status'] = 1
  elif data.at[i,"Marital_Status"] == 'Married':
    data.at[i,'Marital_Status'] = 2
  elif data.at[i,"Marital_Status"] == 'Divorced':
    data.at[i,'Marital_Status'] = 3
  elif data.at[i,"Marital_Status"] == 'Unknown':
    data.at[i,'Marital_Status'] = 0
data['Marital_Status']

0        2
1        1
2        2
3        0
4        2
        ..
10122    1
10123    3
10124    2
10125    0
10126    2
Name: Marital_Status, Length: 10127, dtype: object

##Income_Category

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Income_Category"] == 'Less than $40K':
    data.at[i,'Income_Category'] = 1
  elif data.at[i,"Income_Category"] == "$40K - $60K":
    data.at[i,'Income_Category'] = 2
  elif data.at[i,"Income_Category"] == "$60K - $80K":
    data.at[i,'Income_Category'] = 3
  elif data.at[i,"Income_Category"] == "$80K - $120K":
    data.at[i,'Income_Category'] = 4
  elif data.at[i,"Income_Category"] == "$120K +":
    data.at[i,'Income_Category'] = 5
  elif data.at[i,"Income_Category"] == 'Unknown':
    data.at[i,'Income_Category'] = 0
data['Income_Category']

0        3
1        1
2        4
3        1
4        3
        ..
10122    2
10123    2
10124    1
10125    2
10126    1
Name: Income_Category, Length: 10127, dtype: object

##Card_Category

In [ ]:
for i, row in data.iterrows():
  if data.at[i,"Card_Category"] == 'Blue':
    data.at[i,'Card_Category'] = 1
  elif data.at[i,"Card_Category"] == "Silver":
    data.at[i,'Card_Category'] = 2
  elif data.at[i,"Card_Category"] == "Gold":
    data.at[i,'Card_Category'] = 3
  elif data.at[i,"Card_Category"] == "Platinum":
    data.at[i,'Card_Category'] = 4
data['Card_Category']

0        1
1        1
2        1
3        1
4        1
        ..
10122    1
10123    1
10124    1
10125    1
10126    2
Name: Card_Category, Length: 10127, dtype: object

#Exporting Current Data

In [ ]:
data.to_csv('BankChruner-Processed-2.csv',index=False)